import 'package:flutter/material.dart';
import 'package:get/get.dart';

class PrivacyPolicyHindi extends StatelessWidget {

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.white,
        title: Text(
          "Privacy_policy".tr,
          style: const TextStyle(
              fontSize: 16, fontWeight: FontWeight.w700, fontFamily: "Bitter"),
        ),
      ),
      body: Padding(
        padding: const EdgeInsets.all(16.0),
        child: SingleChildScrollView(
          child: const Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Text(
                "इस नीति की प्रकृति",
                style: TextStyle(
                    fontSize: 14,
                    fontWeight: FontWeight.w500,
                    fontFamily: "Bitter"),
              ),
              Text(
                "यह गोपनीयता नीति (नीति) एग्रीसारथी और इसकी वेबसाइटों, मोबाइल साइटों और मोबाइल एप्लिकेशन (वेबसाइटों) के सभी उपयोगकर्ताओं के बीच कानूनी रूप से बाध्यकारी दस्तावेज है। स्पष्टता के लिए, इस नीति में आप, आपका, आपका और स्वयं शब्दों का उपयोग वेबसाइट के सभी उपयोगकर्ताओं को संदर्भित करने के लिए समझा जाएगा, और इसके विपरीत, हम, हमें, और हमारा शब्दों को एग्रीसारथी शब्द के अंतर्गत आने वाली उपयुक्त इकाई को संदर्भित करने के लिए समझा जाएगा।\nइस नीति के माध्यम से हम आपका ध्यान तीन व्यापक पहलुओं की ओर आकर्षित करना चाहते हैं:\n- एग्रीसारथी आपसे किस प्रकार का डेटा या जानकारी एकत्रित करेगा;\n- ऐसे संग्रह का उद्देश्य;\n- एकत्रित डेटा को तीसरे पक्ष के साथ साझा करने की अग्रिसारथी की नीति।\nयह नीति आपकी प्रत्यक्ष या अप्रत्यक्ष स्वीकृति पर प्रभावी होगी (जैसे, वेबसाइट पर सबमिट टैब पर क्लिक करके, या वेबसाइट का उपयोग करके, या किसी अन्य माध्यम से)। वेबसाइट का उपयोग जारी रखते हुए, आप स्वीकार करते हैं कि आपने इस नीति को पढ़ और समझ लिया है, और आपने नीचे सूचीबद्ध शर्तों के अनुसार आपके डेटा को एकत्र करने, संग्रहीत करने, संसाधित करने, प्रकट करने और स्थानांतरित करने के लिए अग्रिसारथी को अपनी सहमति प्रदान की है। आप आगे स्वीकार करते हैं कि आपकी जानकारी को साझा करना, जैसा कि आवश्यक हो सकता है, किसी तीसरे पक्ष के अधिकारों का उल्लंघन नहीं करता है, और ऐसी जानकारी का संग्रह या हस्तांतरण हमें या किसी अन्य व्यक्ति को गलत लाभ या हानि नहीं पहुंचाएगा।"
        ,
                style: TextStyle(
                    fontSize: 12,
                    fontWeight: FontWeight.w400,
                    fontFamily: "Bitter"),
              ),
              SizedBox(height: 10,),
              Text(
                "अग्रिसारथी द्वारा एकत्रित आंकड़ों की प्रकृति",
                style: TextStyle(
                    fontSize: 14,
                    fontWeight: FontWeight.w500,
                    fontFamily: "Bitter"),
              ),
              Text(
                "वेबसाइट के उपयोग के माध्यम से, आपसे व्यक्तिगत और गैर-व्यक्तिगत दोनों डेटा प्रदान करने के लिए कहा जा सकता है। व्यक्तिगत डेटा किसी भी डेटा को संदर्भित करता है जिसका उपयोग आपको विशिष्ट रूप से पहचानने या आपसे संपर्क करने के लिए किया जा सकता है। इस नीति के लिए, व्यक्तिगत डेटा शब्द में निम्नलिखित शामिल होंगे, लेकिन इन तक सीमित नहीं होंगे:\n1. आपका पता,\n2. आपका टेलीफोन नंबर,\n3. आपका ई-मेल पता या अन्य संपर्क जानकारी,\n4, आपकी जन्मतिथि,\n5. आपका लिंग,\n6. वेबसाइट पर आपके लेन-देन से संबंधित जानकारी, (बिक्री या खरीद इतिहास सहित),\n7, इंटरनेट प्रोटोकॉल पता,\n8. संवेदनशील व्यक्तिगत डेटा या जानकारी शब्द को सूचना प्रौद्योगिकी (उचित) अधिनियम के तहत परिभाषित किया गया है सुरक्षा प्रथाएं और प्रक्रियाएं तथा संवेदनशील व्यक्तिगत डेटा की जानकारी) नियम, 2011 के तहत अधिनियमित सूचना प्रौद्योगिकी अधिनियम, 2000;\n 9. आपके संचार उपकरण का पहचान कोड जिसका उपयोग आप वेबसाइट तक पहुँचने के लिए करते हैं\n10. आपके द्वारा पंजीकरण प्रक्रिया के दौरान वेबसाइट पर प्रदान की गई कोई अन्य जानकारी, यदि कोई हो।\nएग्रीसारथी गैर-व्यक्तिगत डेटा भी एकत्र कर सकता है, जिसका उपयोग आपको व्यक्तिगत रूप से पहचानने के लिए नहीं किया जा सकता है। इस डेटा में शामिल हो सकते हैं:\n1. आपका भौगोलिक स्थान,\n2. आपका दूरसंचार या इंटरनेट सेवा प्रदाता, जिसमें आपका ब्राउज़र विवरण भी शामिल है।\n3. वेबसाइट तक पहुंचने के लिए उपयोग किए गए डिवाइस का विवरण,\n4. हमारी वेबसाइट पर आने से पहले आपने जिस वेबसाइट को अंतिम बार देखा था उसका विवरण,\nवेबसाइट पर आपके ठहरने की अवधि, आपके प्रवेश की तारीख और समय के साथ-साथ सत्र में भी संग्रहीत की जाती है।\nकृपया ध्यान दें कि इस नीति के अंतर्गत व्यक्तिगत जानकारी और गैर-व्यक्तिगत डेटा को अलग-अलग तरीके से व्यवहार किया जा सकता है।\nहम आपका डेटा कैसे एकत्रित करते हैं\nव्यक्तिगत डेटा विभिन्न तरीकों से एकत्र किया जा सकता है:\n1. वेबसाइट पर उपयोगकर्ता, विक्रेता या सेवा प्रदाता के रूप में पंजीकरण के दौरान,\n2. वेबसाइट पर दी जाने वाली कुछ सेवाओं का लाभ उठाते समय, जैसे बिक्री के लिए प्रस्ताव देना, ऑनलाइन खरीदारी करना, सामान किराये पर लेना या किराये पर लेना, किसी ऑनलाइन सर्वेक्षण या प्रतियोगिता में भाग लेना, वेबसाइट पर उपयोगकर्ता समीक्षा पोस्ट करते समय, या यहां तक कि फोन, ईमेल या अन्य माध्यमों से अग्रिसारथी की ग्राहक सेवा से संवाद करते समय भी।\n3. वेबसाइट पर अन्यथा कोई भी व्यवसाय करते समय या अग्रिसारथी के साथ अन्यथा व्यवहार करते समय।\nहम आपका व्यक्तिगत डेटा तीसरे पक्ष से भी प्राप्त कर सकते हैं, जैसे कि सोशल मीडिया सेवाएँ, व्यावसायिक रूप से उपलब्ध स्रोत और व्यावसायिक भागीदार। यदि आप किसी सोशल मीडिया सेवा के माध्यम से वेबसाइट तक पहुँचते हैं, या हमारी वेबसाइट पर किसी सेवा को सोशल मीडिया सेवा से जोड़ते हैं, तो हमारे द्वारा एकत्र किए जाने वाले डेटा में उस सोशल मीडिया सेवा से जुड़ा उपयोगकर्ता नाम, कोई भी जानकारी या सामग्री शामिल हो सकती है जिसे सोशल मीडिया सेवा को हमारे साथ साझा करने का अधिकार है (जैसे कि आपका प्रोफ़ाइल चित्र, ईमेल पता या दोस्तों की सूची), और कोई भी जानकारी जिसे आपने उस सोशल मीडिया सेवा के संबंध में सार्वजनिक किया है। आप इस गोपनीयता नीति के अनुसार एग्रीसारथी को ऐसी जानकारी और सामग्री एकत्र करने, संग्रहीत करने और उपयोग करने और बनाए रखने के लिए अधिकृत करते हैं।\nहम कुकीज़ का उपयोग करके बड़े पैमाने पर गैर-व्यक्तिगत डेटा एकत्र करते हैं। एग्रीसारथी आपके डिवाइस पर अस्थायी या स्थायी कुकीज़ संग्रहीत कर सकता है, जिसका उपयोग आपकी जानकारी को हमारे सर्वर तक पहुँचाने के लिए किया जा सकता है। आप अपने ब्राउज़र के माध्यम से अपने कंप्यूटर से इन कुकीज़ को मिटा सकते हैं या ब्लॉक करना चुन सकते हैं। हालाँकि, यदि आप कुकीज़ के हमारे उपयोग को अक्षम करते हैं, तो आपको कुछ का उपयोग करने से रोका जा सकता है \n वेबसाइट पर उपलब्ध सुविधाएँ.\n एग्रीसारथी इंटरनेट और वेबसाइट पर हमारी ओर से विज्ञापन देने के लिए तीसरे पक्ष के सेवा प्रदाताओं का भी उपयोग कर सकता है। ये विज्ञापन वेबसाइट पर आपकी यात्राओं और वेबसाइट पर हमारे उत्पादों और अन्य सेवाओं के साथ आपकी बातचीत के बारे में गैर-व्यक्तिगत जानकारी एकत्र कर सकते हैं। "
                ,
                style: TextStyle(
                    fontSize: 12,
                    fontWeight: FontWeight.w400,
                    fontFamily: "Bitter"),
              ),
              SizedBox(height: 10,),
              Text(
                "एकत्रित डेटा की प्रामाणिकता",
                style: TextStyle(
                    fontSize: 14,
                    fontWeight: FontWeight.w500,
                    fontFamily: "Bitter"),
              ),
              Text(
                "हमारी वेबसाइट का उपयोग करते समय आपके द्वारा प्रदान किए गए डेटा की प्रामाणिकता के लिए हम ज़िम्मेदार नहीं हैं। इसलिए, आप एग्रीसारथी को बताते हैं कि:\n1. आपके द्वारा समय-समय पर अग्रिसारथी को प्रदान किया गया डेटा प्रामाणिक, सही, वर्तमान और अद्यतन होगा;\n2. आप कानूनी तौर पर अग्रिसरथी को ऐसा डेटा प्रदान करने के हकदार हैं, और हमारे बाद के भंडारण, उपयोग, प्रसंस्करण, और इसका हस्तांतरण किसी तीसरे पक्ष के अधिकारों का उल्लंघन नहीं होगा। आपके द्वारा प्रदान किए गए डेटा में अशुद्धि या अप्रमाणिकता के कारण किसी तीसरे पक्ष के अधिकारों का उल्लंघन होने की स्थिति में, आप ऐसी अशुद्धि के संबंध में किए गए संपूर्ण खर्चों के लिए एग्रीसारथी को क्षतिपूर्ति देंगे और उसे नुकसान से बचाएंगे।\nहम आपका डेटा क्यों एकत्र करते हैं और इसका उद्देश्य क्या है एग्रीसारथी केवल आपके व्यक्तिगत डेटा को, जिसमें आपका संवेदनशील व्यक्तिगत डेटा भी शामिल है, उन उद्देश्यों के लिए एकत्रित, उपयोग, संग्रहीत और संसाधित करता है जो वैध हैं और हमारे व्यावसायिक कार्यों या गतिविधियों (उद्देश्यों) के निर्वहन के लिए आवश्यक और जुड़े हुए हैं। आप इस तरह के संग्रह को यहाँ निर्धारित शर्तों पर अनुमोदित और सहमति देते हैं। ऐसी स्थितियों की एक उदाहरणात्मक (और किसी भी तरह से संपूर्ण नहीं) सूची जिसमें हम आपका डेटा एकत्र कर सकते हैं, इस प्रकार है:\n1. वेबसाइट के आपके उपयोग या हमारी अन्य सेवाओं का आनंद लेने में सुविधा प्रदान करना;\n2. आपकी पूछताछ का जवाब देना या विभिन्न उत्पाद सेवाओं के बारे में जानकारी के लिए आपके अनुरोधों को पूरा करना, और वेबसाइट पर उपलब्ध ऑफर;\n3. आपको नियम व शर्तों, उपयोगकर्ता समझौतों और नीतियों में परिवर्तन के बारे में महत्वपूर्ण जानकारी भेजना और/या अन्य प्रशासनिक जानकारी;\n4. आपको अकादमिक सर्वेक्षण और विपणन संचार भेजना जो एग्रीसारथी का मानना है कि आपके लिए रुचिकर हो सकता है या जो हमारे आंतरिक विकास के लिए आवश्यक हैं;\n5. आपकी आवश्यकताओं के अनुरूप विज्ञापन, उत्पाद और ऑफ़र प्रस्तुत करके वेबसाइट पर आपके अनुभव को वैयक्तिकृत करना पसंद;\n6. वेबसाइट पर आने वाली समस्याओं के समाधान में आपकी सहायता करना, जिसमें किसी भी तकनीकी विफलता का समाधान करना शामिल है:\n7. आपकी खरीदारी पूरी करने और उसे पूरा करने में मदद करना, यानी भुगतान संसाधित करना, आपके बारे में संचार भेजना खरीद, और आपको बिक्री के बाद की सेवाएं प्रदान करना;\n8. उपभोक्ता वरीयताओं और व्यवहार के विश्लेषण के माध्यम से हमारी वेबसाइटों की गुणवत्ता का प्रबंधन और सुधार करना;\n9. सिंगल साइन ऑन जैसी सेवाओं को सुविधाजनक बनाना, जो उपयोगकर्ताओं को एक ही साइट के माध्यम से कई वेबसाइटों/एप्लिकेशन तक पहुंच प्रदान करता है। उनके व्यक्तिगत लॉगिन क्रेडेंशियल की एकल प्रविष्टि;\n10. अग्रिसारथी या तृतीय पक्ष सेवा प्रदाताओं और व्यावसायिक सहयोगियों द्वारा शुरू किए गए कार्यक्रमों और पहलों को सुविधाजनक बनाना;\n11. हमारी सेवाओं का उपयोग कैसे किया जाता है इसका विश्लेषण करना, विज्ञापनों की प्रभावशीलता को मापना और भुगतान को सुविधाजनक बनाना हमारी वेबसाइट के माध्यम से बनाया गया;\n12. कानूनी नोटिसों पर हमारी प्रतिक्रिया और न्यायिक या अर्ध-न्यायिक कार्यवाही में हमारी भागीदारी को सुविधाजनक बनाना हमारे खिलाफ़;\n13. 'उपकरण स्थापना, सेवा या किसी भी उद्देश्य के लिए आपके साथ तीसरे पक्ष के संचार को सुविधाजनक बनाने के लिए अतिरिक्त उत्पाद-संबंधी सहायता:\n14. किसी भी सुरक्षा उल्लंघन, कंप्यूटर संदूषक, कंप्यूटर वायरस या किसी भी अन्य के स्रोत का पता लगाना और उसका बेहतर निर्धारण करना अन्य कारक जो हमारी वेबसाइट पर प्रदान की गई सेवाओं पर प्रतिकूल प्रभाव डालने की संभावना रखते हैं;\n15. हमारी वेबसाइट पर किसी भी संदिग्ध अवैध गतिविधि की आंतरिक जांच की सुविधा प्रदान करना;\n16, जांच या आंतरिक लेखापरीक्षा के एक भाग के रूप में संबंधित कंप्यूटर संसाधन की फोरेंसिक जांच करना;\n17. संभावित निवेशकों या खरीदारों को अग्रिसारथी और हमारी वेबसाइट का मूल्यांकन करने में सुविधा प्रदान करना।\n18. गूगल और मेटा के माध्यम से किसी भी नाम से अभियान, विज्ञापन और अन्य विपणन रणनीतियों को चलाना या प्रसारित करना।"
    ,
                style: TextStyle(
                    fontSize: 12,
                    fontWeight: FontWeight.w400,
                    fontFamily: "Bitter"),
              ),
              SizedBox(height: 10,),
              Text(
                "अपने डेटा को तीसरे पक्ष के साथ साझा करना और प्रकट करना",
                style: TextStyle(
                    fontSize: 14,
                    fontWeight: FontWeight.w500,
                    fontFamily: "Bitter"),
              ),
              Text(
                "आप इस बात को स्वीकार करते हैं कि अग्रिसरथी आपके सभी या किसी भी डेटा को स्थानांतरित, साझा, प्रकट या अलग कर सकता है, जिसमें शामिल हैं\nआपका संवेदनशील व्यक्तिगत डेटा, तीसरे पक्ष, भागीदारों, बैंकों या अन्य वित्तीय संस्थानों को, चाहे वे कंपनी के भीतर हों या बाहर भारत गणराज्य, और इस तरह के हस्तांतरण के लिए सहमति। हालाँकि, किसी भी स्थिति में आपका संवेदनशील व्यक्तिगत डेटा अग्रिसारथी या हमारे किसी भी साझेदार या तृतीय पक्ष सेवा प्रदाता द्वारा प्रकाशित।\nइसके अलावा, आपके संवेदनशील व्यक्तिगत डेटा का खुलासा इस स्पष्ट शर्त पर किया जाएगा कि यह नहीं है प्रासंगिक तृतीय पक्ष प्राप्तकर्ता द्वारा प्रकट, हस्तांतरित या किसी भी तरीके से आगे साझा नहीं किया गया।\nयदि आपका कोई भी डेटा एग्रीसारथी द्वारा किसी तीसरे पक्ष को स्थानांतरित किया जाता है, तो हम स्वीकार करते हैं कि ऐसा स्थानांतरण केवल उस इकाई (भारत के क्षेत्र के भीतर या बाहर स्थित) को किया जाएगा, जो डेटा सुरक्षा व्यवस्था के अधीन है जो भारत में मौजूद व्यवस्था जितनी ही सख्त है। एग्रीसारथी आपके व्यक्त या निहित अनुमति के बिना सांख्यिकीय डेटा और अन्य विवरण (आपके व्यक्तिगत डेटा के अलावा) साझा कर सकता है अग्रिसारथी, उसके सहयोगी, एजेंट, तृतीय पक्ष सेवा द्वारा शुरू किए गए विभिन्न कार्यक्रमों या पहलों को सुविधाजनक बनाने के लिए सहमति प्रदाता, भागीदार, या बैंक और वित्तीय संस्थान, समय-समय पर। हम जानकारी स्थानांतरित/प्रकट/साझा कर सकते हैं (आपकी व्यक्तिगत जानकारी के अलावा) उन पक्षों को जो हमारे व्यवसाय का समर्थन करते हैं, जैसे तकनीकी जानकारी प्रदान करना बुनियादी ढांचा सेवाएँ, हमारी सेवाओं का उपयोग कैसे किया जाता है इसका विश्लेषण, विज्ञापनों की प्रभावशीलता को मापना, प्रदान करना ग्राहक / खरीदार सेवाएँ, भुगतान की सुविधा प्रदान करना, या अकादमिक अनुसंधान और सर्वेक्षण आयोजित करना। ये सहयोगी और तृतीय-पक्ष सेवा प्रदाता इस गोपनीयता नीति के अनुरूप गोपनीयता दायित्वों का पालन करेंगे। उपरोक्त के बावजूद, हम अन्य तृतीय पक्षों जैसे क्रेडिट/डेबिट कार्ड प्रोसेसिंग कंपनी, भुगतान का उपयोग करते हैं गेटवे, प्रीपेड कार्ड आदि आपको हमारी वेबसाइट पर उत्पाद खरीदने या सेवाओं का लाभ उठाने के लिए भुगतान करने में सक्षम बनाते हैं। जब आप इन सेवाओं के लिए साइन अप करते हैं, तो आपके पास भविष्य के संदर्भ के लिए अपने कार्ड विवरण को सहेजने की क्षमता हो सकती है और तेजी से भविष्य के भुगतान। ऐसे मामले में, हम आपकी प्रासंगिक व्यक्तिगत जानकारी को तीसरे पक्ष के साथ आवश्यकतानुसार साझा कर सकते हैं ऐसी सेवाएँ प्रदान करें, जिनमें आपका नाम, निवास और ईमेल पता शामिल है। भुगतान या प्राधिकरण की प्रक्रिया पूरी तरह से इन तृतीय-पक्ष की नीतियों, नियमों और शर्तों के अनुसार है और हम किसी भी तरह से नहीं हैं आपके भुगतानों के प्रसंस्करण में किसी भी देरी या विफलता के लिए आप या किसी तीसरे पक्ष के प्रति जिम्मेदार या उत्तरदायी नहीं होंगे। \nहम कानून या विनियमन द्वारा या किसी कानूनी प्रावधान के तहत ऐसा करने की आवश्यकता होने पर आपकी जानकारी का खुलासा करने का अधिकार सुरक्षित रखते हैं। कानून के तहत दायित्व या आदेश या किसी कानून प्रवर्तन या सरकारी एजेंसी या न्यायिक के अनुरोध के जवाब में। अर्ध-न्यायिक या किसी अन्य वैधानिक या संवैधानिक प्राधिकरण या हमारे कानूनी अधिकारों को स्थापित करने या उनका प्रयोग करने या उनकी रक्षा करने के लिए कानूनी दावों के विरुद्ध।"
    ,
                style: TextStyle(
                    fontSize: 12,
                    fontWeight: FontWeight.w400,
                    fontFamily: "Bitter"),
              ),
              SizedBox(height: 10,),
              Text(
                "हमारी वेबसाइट पर थर्ड पार्टी लिंक",
                style: TextStyle(
                    fontSize: 14,
                    fontWeight: FontWeight.w500,
                    fontFamily: "Bitter"),
              ),
              Text(
                "हमारी वेबसाइट पर तीसरे पक्ष के विज्ञापनों, तीसरे पक्ष की वेबसाइटों या किसी तीसरे पक्ष की इलेक्ट्रॉनिक संचार सेवा के लिंक दिए जा सकते हैं। जब तक अन्यथा स्पष्ट रूप से निर्दिष्ट न किया जाए, आप स्वीकार करते हैं कि ये सेवाएँ तीसरे पक्ष द्वारा संचालित की जाती हैं और एग्रीसारथी द्वारा नियंत्रित, संबद्ध या उससे जुड़ी नहीं हैं। \nएग्रीसारथी आपके और किसी भी ऐसे तीसरे पक्ष की वेबसाइट या विज्ञापन के बीच किसी भी बातचीत के लिए जिम्मेदार नहीं है। तदनुसार, हम ऐसे सेवा प्रदाताओं द्वारा पालन की जाने वाली गोपनीयता नीतियों के बारे में या किसी भी जानकारी की सटीकता के बारे में कोई प्रतिनिधित्व नहीं करते हैं जिसका आप ऐसे तीसरे पक्ष के साथ उपयोग या संचार करते समय सामना कर सकते हैं या उपभोग कर सकते हैं। इसके अलावा, हम ऐसे तृतीय-पक्षों द्वारा सीधे हमारी वेबसाइट पर या उनकी अपनी वेबसाइट पर प्रदर्शित संदेशों का समर्थन या समर्थन नहीं करते हैं।\nऐसी तृतीय-पक्ष वेबसाइटों को प्रदान किया गया कोई भी डेटा उनकी संबंधित गोपनीयता नीतियों की शर्तों द्वारा शासित होगा। इसलिए, हम आपको उनकी सेवाओं का उपयोग करने से पहले इन नीतियों को पढ़ने और उनसे परिचित होने के लिए प्रोत्साहित करते हैं।"
                    ,
                style: TextStyle(
                    fontSize: 12,
                    fontWeight: FontWeight.w400,
                    fontFamily: "Bitter"),
              ),
              SizedBox(height: 10,),
              Text(
                "आपके डेटा की सुरक्षा और अवधारण",
                style: TextStyle(
                    fontSize: 14,
                    fontWeight: FontWeight.w500,
                    fontFamily: "Bitter"),
              ),
              Text(
                "आपकी व्यक्तिगत जानकारी की सुरक्षा हमारे लिए महत्वपूर्ण है। अग्रिसारथी आपके व्यक्तिगत डेटा की सुरक्षा सुनिश्चित करने का प्रयास करता है अनधिकृत पहुंच, परिवर्तन, प्रकटीकरण या विनाश के खिलाफ। इस उद्देश्य के लिए, अग्रिसारथी आंतरिक समीक्षा को अपनाता है डेटा संग्रह, भंडारण और प्रसंस्करण प्रथाओं और सुरक्षा उपायों, जिसमें उचित एन्क्रिप्शन और भौतिक शामिल हैं एग्रीसारथी द्वारा आपके व्यक्तिगत डेटा को संग्रहीत करने वाली प्रणालियों तक अनधिकृत पहुँच से बचाव के लिए सुरक्षा उपाय। एग्रीसारथी आपकी जानकारी की सुरक्षा के लिए लागू कानूनों के तहत अनिवार्य उचित सुरक्षा प्रथाओं और प्रक्रियाओं को अपनाएँ। बशर्ते कि नुकसान का दावा करने का आपका अधिकार सूचना प्रौद्योगिकी अधिनियम, 2000 के तहत केवल वैधानिक नुकसान का दावा करने के अधिकार तक सीमित होगा और आप एग्रीसारथी को अनुबंध या अपकार के तहत नुकसान के किसी भी दावे से छूट देते हैं और मुक्त करते हैं।\nअग्रिसारथी आपकी जानकारी को गोपनीयता समझौते के तहत तीसरे पक्ष के साथ साझा कर सकता है, जिसमें अन्य बातों के साथ-साथ यह प्रावधान है कि ऐसे तीसरे पक्ष जानकारी का तब तक खुलासा नहीं करेंगे जब तक कि ऐसा खुलासा उद्देश्य के लिए न हो। हालाँकि, अग्रिसारथी किसी भी सुरक्षा उल्लंघन या आपकी व्यक्तिगत जानकारी प्राप्त करने वाले किसी भी तीसरे पक्ष की किसी भी कार्रवाई के लिए जिम्मेदार नहीं है। अग्रिसारथी आपके द्वारा अपनी व्यक्तिगत जानकारी तीसरे पक्ष (किसी भी तीसरे पक्ष की वेबसाइट सहित, भले ही वेबसाइट पर ऐसी तृतीय-पक्ष वेबसाइटों के लिंक दिए गए हों) को प्रदान करने के परिणामस्वरूप आपको होने वाले किसी भी नुकसान या चोट के लिए उत्तरदायी नहीं है।\nयद्यपि हम आपके किसी भी व्यक्तिगत डेटा को सुरक्षित रखने और उस तक अनधिकृत पहुंच को रोकने के लिए सभी उचित और उपयुक्त कदम उठाने का प्रयास करेंगे, आप स्वीकार करते हैं कि इंटरनेट या कंप्यूटर नेटवर्क पूरी तरह से सुरक्षित नहीं हैं और हम आपकी व्यक्तिगत जानकारी की सुरक्षा के संबंध में कोई पूर्ण आश्वासन नहीं दे सकते हैं।\nहमारे द्वारा एकत्रित आपका सारा व्यक्तिगत डेटा, जिसमें संवेदनशील व्यक्तिगत डेटा भी शामिल है, तब तक रखा जाएगा जब तक कि जिस उद्देश्य के लिए इसे एकत्र किया गया था वह पूरा न हो जाए, उससे आगे नहीं। गैर-व्यक्तिगत जानकारी अनिश्चित काल तक रखी जाएगी।"
    ,
                style: TextStyle(
                    fontSize: 12,
                    fontWeight: FontWeight.w400,
                    fontFamily: "Bitter"),
              ),
              SizedBox(height: 10,),
              Text(
                "उपयोगकर्ता विवेक और ऑप्ट-आउट",
                style: TextStyle(
                    fontSize: 14,
                    fontWeight: FontWeight.w500,
                    fontFamily: "Bitter"),
              ),
              Text(
                "आप सहमत हैं और स्वीकार करते हैं कि आप अपनी स्वतंत्र इच्छा से अपना डेटा प्रदान कर रहे हैं। आपके पास अपना डेटा हमें प्रदान न करने या किसी भी समय यहां नियुक्त शिकायत अधिकारी को ईमेल भेजकर या आपको सूचित किए गए किसी अन्य इलेक्ट्रॉनिक मेल पते पर इस तरह प्रदान किए गए डेटा के संबंध में अपनी सहमति वापस लेने का विकल्प है। आप ऊपर बताए गए तरीके से हमसे संपर्क करके किसी भी समय हमें प्रदान की गई जानकारी को संशोधित या अपडेट करने के हकदार हैं।\nयदि आप अपना डेटा हमारे साथ साझा नहीं करना चाहते हैं, तो हम आपको हमारी सेवाओं तक पूर्ण पहुंच से वंचित करने के हकदार हैं।"
                  ,
                style: TextStyle(
                    fontSize: 12,
                    fontWeight: FontWeight.w400,
                    fontFamily: "Bitter"),
              ),
              SizedBox(height: 10,),
              Text(
                "व्यवसाय/परिसंपत्तियों की बिक्री या हस्तांतरण",
                style: TextStyle(
                    fontSize: 14,
                    fontWeight: FontWeight.w500,
                    fontFamily: "Bitter"),
              ),
              Text(
                "एग्रीसारथी विलय, अधिग्रहण, पुनर्गठन, या परिसंपत्तियों या व्यवसाय की बिक्री के भाग के रूप में, या दिवालियापन की स्थिति में, आपके डेटा सहित अपनी सभी परिसंपत्तियों को बेच, हस्तांतरित या अन्यथा साझा कर सकता है। यदि ऐसी बिक्री या हस्तांतरण होता है, तो हम यथोचित रूप से यह सुनिश्चित करेंगे कि आपके द्वारा प्रदान किया गया डेटा और जिसे हमने एकत्र किया है, वह हस्तांतरित व्यक्ति द्वारा इस गोपनीयता नीति के अनुरूप तरीके से संग्रहीत और उपयोग किया जाता है। कोई भी तीसरा पक्ष जिसे एग्रीसारथी उपरोक्त अनुसार हस्तांतरित या बेचता है, उसे आपके द्वारा हमें प्रदान किए गए डेटा या ऐसे हस्तांतरण से तुरंत पहले हमारे द्वारा एकत्र किए गए डेटा का उपयोग जारी रखने का अधिकार होगा। या बिक्री.\nआपका यह भी दायित्व है कि आप इस वेबसाइट का उपयोग केवल उचित और वैध उद्देश्यों के लिए ही करें तथा ऐसी किसी भी गतिविधि में शामिल न हों जो वेबसाइट के माध्यम से परिकल्पित न हो।\nइस गोपनीयता नीति को समय-समय पर संशोधित/अपडेट किया जा सकता है। गोपनीयता नीति को संशोधित/अपडेट करने पर, हम तदनुसार उपरोक्त तिथि को संशोधित करेंगे। हमारा सुझाव है कि आप किसी भी अपडेट के बारे में खुद को अवगत कराने के लिए नियमित रूप से इस गोपनीयता नीति की जांच करें। वेबसाइट का आपका निरंतर उपयोग या उसके बाद डेटा या जानकारी का प्रावधान इस गोपनीयता नीति के ऐसे अपडेट के लिए आपकी बिना शर्त स्वीकृति का संकेत देगा।"
                    ,
                style: TextStyle(
                    fontSize: 12,
                    fontWeight: FontWeight.w400,
                    fontFamily: "Bitter"),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
